// Query returns service principals sign-ins and list them by number of sign-ins pr. ip adress
AADServicePrincipalSignInLogs
| where TimeGenerated > ago(100d)
| summarize LoginCount=count() by ServicePrincipalName, AppId, IPAddress
| sort by LoginCount // Change this to either IPAddress or AppId to sort in anotherway
