SigninLogs
| where TimeGenerated > ago(30d)
| where AuthenticationProtocol == "deviceCode"
| project TimeGenerated, AuthenticationProtocol, UserPrincipalName, Identity, IPAddress, Location, NetworkLocationDetails, DeviceDetail
, ConditionalAccessStatus